# Add / Remove Columns

In [2]:
import pandas as pd

coffee = pd.read_csv("../warmup-data/coffee.csv")

In [42]:
# adding new columns
coffee['price'] = 3.99
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25   3.99
1     Monday       Latte          15   3.99
2    Tuesday    Espresso          30   3.99
3    Tuesday       Latte          20   3.99
4  Wednesday    Espresso          35   3.99

In [43]:
# adding columns based on condition

import numpy as np

coffee['price'] = np.where(coffee['Coffee Type'] == 'Latte', 5.99, 2.99)
coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   2.99
1      Monday       Latte          15   5.99
2     Tuesday    Espresso          30   2.99
3     Tuesday       Latte          20   5.99
4   Wednesday    Espresso          35   2.99
5   Wednesday       Latte          25   5.99
6    Thursday    Espresso          40   2.99
7    Thursday       Latte          30   5.99
8      Friday    Espresso          45   2.99
9      Friday       Latte          35   5.99
10   Saturday    Espresso          45   2.99
11   Saturday       Latte          35   5.99
12     Sunday    Espresso          45   2.99
13     Sunday       Latte          35   5.99

In [44]:
# Drop perticular row
coffee.drop(0)
# This is not actually modifying DataFrame , it return dataframe after droping

          Day Coffee Type  Units Sold  price
1      Monday       Latte          15   5.99
2     Tuesday    Espresso          30   2.99
3     Tuesday       Latte          20   5.99
4   Wednesday    Espresso          35   2.99
5   Wednesday       Latte          25   5.99
6    Thursday    Espresso          40   2.99
7    Thursday       Latte          30   5.99
8      Friday    Espresso          45   2.99
9      Friday       Latte          35   5.99
10   Saturday    Espresso          45   2.99
11   Saturday       Latte          35   5.99
12     Sunday    Espresso          45   2.99
13     Sunday       Latte          35   5.99

In [45]:
# to drop columns

coffee.drop(columns=["price"])
# This is not actually modifying DataFrame , it return dataframe after droping

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [46]:
coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   2.99
1      Monday       Latte          15   5.99
2     Tuesday    Espresso          30   2.99
3     Tuesday       Latte          20   5.99
4   Wednesday    Espresso          35   2.99
5   Wednesday       Latte          25   5.99
6    Thursday    Espresso          40   2.99
7    Thursday       Latte          30   5.99
8      Friday    Espresso          45   2.99
9      Friday       Latte          35   5.99
10   Saturday    Espresso          45   2.99
11   Saturday       Latte          35   5.99
12     Sunday    Espresso          45   2.99
13     Sunday       Latte          35   5.99

In [47]:
# how can we actually frop columns or row

# coffee.drop(0, inplace=True)
# coffee.drop(columns=['price'], inplace=True)

In [48]:
coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   2.99
1      Monday       Latte          15   5.99
2     Tuesday    Espresso          30   2.99
3     Tuesday       Latte          20   5.99
4   Wednesday    Espresso          35   2.99
5   Wednesday       Latte          25   5.99
6    Thursday    Espresso          40   2.99
7    Thursday       Latte          30   5.99
8      Friday    Espresso          45   2.99
9      Friday       Latte          35   5.99
10   Saturday    Espresso          45   2.99
11   Saturday       Latte          35   5.99
12     Sunday    Espresso          45   2.99
13     Sunday       Latte          35   5.99

# Copy DataFrame

In [49]:
coffee = pd.read_csv('../warmup-data/coffee.csv')

# now coffee have three cols name, type and units sold

coffee_new = coffee # this will make new dataframe like coffee as coffee_new

coffee_new['price'] = 4.99 # this will add new columns in coffee_new, but... 

coffee # coffee also have price even if we didn't created it, this is because of python use same memory set for both

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [50]:
# How to avoid it
coffee = pd.read_csv('../warmup-data/coffee.csv')
coffee_new = coffee.copy() # we can make copy using this syntax
coffee_new['price'] = 4.99

coffee # coffee don't have price column

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [52]:
coffee_new['revenue'] = coffee_new['price'] * coffee_new['Units Sold']

coffee_new

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25   4.99   124.75
1      Monday       Latte          15   4.99    74.85
2     Tuesday    Espresso          30   4.99   149.70
3     Tuesday       Latte          20   4.99    99.80
4   Wednesday    Espresso          35   4.99   174.65
5   Wednesday       Latte          25   4.99   124.75
6    Thursday    Espresso          40   4.99   199.60
7    Thursday       Latte          30   4.99   149.70
8      Friday    Espresso          45   4.99   224.55
9      Friday       Latte          35   4.99   174.65
10   Saturday    Espresso          45   4.99   224.55
11   Saturday       Latte          35   4.99   174.65
12     Sunday    Espresso          45   4.99   224.55
13     Sunday       Latte          35   4.99   174.65

In [53]:
# Rename columns

coffee_new = coffee_new.rename(columns={'price':'Price', 'revenue':'Revenue'})
coffee_new

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso          25   4.99   124.75
1      Monday       Latte          15   4.99    74.85
2     Tuesday    Espresso          30   4.99   149.70
3     Tuesday       Latte          20   4.99    99.80
4   Wednesday    Espresso          35   4.99   174.65
5   Wednesday       Latte          25   4.99   124.75
6    Thursday    Espresso          40   4.99   199.60
7    Thursday       Latte          30   4.99   149.70
8      Friday    Espresso          45   4.99   224.55
9      Friday       Latte          35   4.99   174.65
10   Saturday    Espresso          45   4.99   224.55
11   Saturday       Latte          35   4.99   174.65
12     Sunday    Espresso          45   4.99   224.55
13     Sunday       Latte          35   4.99   174.65

In [56]:
coffee = coffee_new.copy()
coffee

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso          25   4.99   124.75
1      Monday       Latte          15   4.99    74.85
2     Tuesday    Espresso          30   4.99   149.70
3     Tuesday       Latte          20   4.99    99.80
4   Wednesday    Espresso          35   4.99   174.65
5   Wednesday       Latte          25   4.99   124.75
6    Thursday    Espresso          40   4.99   199.60
7    Thursday       Latte          30   4.99   149.70
8      Friday    Espresso          45   4.99   224.55
9      Friday       Latte          35   4.99   174.65
10   Saturday    Espresso          45   4.99   224.55
11   Saturday       Latte          35   4.99   174.65
12     Sunday    Espresso          45   4.99   224.55
13     Sunday       Latte          35   4.99   174.65

# Add / Remove Data (String Operation)

In [3]:
bios = pd.read_csv('../data/bios.csv')
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [ ]:
# let get only first name columns

bios['first name'] = bios['name'].str.split(' ').str[0]

0    Jean-Franois
1           Arnaud
2             Jean
3          Jacques
4           Albert
5          Nicolas
Name: first name, dtype: object

In [14]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first name    145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

In [ ]:
# Convert object to date_time datatype

bios['born_dateTime'] = pd.to_datetime(bios['born_date'])
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first name,born_dateTime
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17

In [21]:
bios['born_year'] = bios['born_dateTime'].dt.year # gives year from date time

bios[['name','born_year']].head()

                    name  born_year
0  Jean-Franois Blanchy     1886.0
1         Arnaud Boetsch     1969.0
2           Jean Borotra     1898.0
3        Jacques Brugnon     1895.0
4           Albert Canet     1878.0

In [22]:
# save this as new csv file

bios.to_csv('../data/new_bios.csv', index = False) # save as csv file

# Add Using Lambda function

In [37]:
# new columns using lambda

bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x<155 else ('Average' if x<185 else 'Tall'))

bios[['name','height_category']].loc[5:15]

                       name height_category
5         Nicolas Chatelain         Average
6             Patrick Chila         Average
7              Henri Cochet            Tall
8             Marcel Cousin            Tall
9        Guy de la Chapelle            Tall
10  lie, Comte de Lastours            Tall
11              Max Decugis            Tall
12                J. Defert            Tall
13           tienne Durand            Tall
14              Damien loi         Average
15   Adrien Fauchier-Magnan            Tall

In [47]:
bios.loc[bios['height_category'] == 'Short',['name','height_cm']].head()

                name  height_cm
596     Chan Siu Yuk      152.0
599  Wong-Lau So Han      152.0
763  Jacqueline Daz      146.0
769     Marcos Nez      150.0
777      Deng Yaping      150.0

In [48]:
# custom functiion

def categorize(row):
  if row['height_cm'] < 175 and row['weight_kg'] < 75:
    return 'lightweight'
  else:
    return 'average'
  
bios['category'] = bios.apply(categorize, axis=1) # axis=1 means apply on row, 0 = columns

bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first name,born_dateTime,born_year,height_category,category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0,Tall,average
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,Average,average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,Average,average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,Average,lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,Tall,average